package searchFilter

/*
Фильтр должен представлять собой отдельную панель с настройками,
где пользователь выбирает какие форматы нужно игнорировать

*также в таблицу выносятся файлы которые будут проигнорированы
*определить ряд файлов, которые не будут подвергаться анализу

 */

//нужен отдельный файл с конфигом в котором будут указываться все расширения доступные для поиска
//



/*
	только приступили к разработке
	пока есть только план и отдельные наработки
	ТЗ нету есть только устные задачи

	написать план разработки
	гуи не трогал еще
	у
 */